import * as Yup from "yup"
export const addCategoryFormSchema = Yup.object({
  name: Yup.string()
    .required("Обов`язковий")
    .min(3, "Назва має складатися не менше ніж з 3 символів")
    .max(20, "Назва не може перевищувати 20 символи")
    .matches(
      /^[АаБбВвГгҐґДдЕеЄєЖжЗзИиІіЇїЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя\s\d]+$/g,
      "Можна використовувати лише українські літери, цифри та пробіли"
    ),
  description: Yup.string()
    .required("Обов`язковий")
    .min(3, "Посилання має складатися не менше ніж з 3 символів")
    .max(64, "Посилання не може перевищувати 64 символи")
    .matches(
      /^[АаБбВвГгҐґДдЕеЄєЖжЗзИиІіЇїЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя\d\s]+$/g,
      "Можна використовувати лише українські літери, цифри та пробіли"
    ),
  image: Yup.mixed()
    .required("Обов`язковий")
    .test(
      "fileFormat",
      "Дозволено тільки картинки",
      file => (file as File).type.split("/")[0] === "image"
    )
    .test("fileSize", "Розмір файла не більше 3Мб", file => (file as File).size <= 3 * 1024 * 1024),
})
// url: Yup.string()
//   .required("Обов`язковий")
//   .min(4, "Посилання має складатися не менше ніж з 3 символів")
//   .max(64, "Посилання не може перевищувати 64 символи")
//   .matches(
//     /^https?:\/\/[\w/.$#@?&-_=+]+$/g,
//     "Можна використовувати лише латинські літери, має починатись з 'http://' або 'https://'"
//   ),
// metaTitle: Yup.string()
//   .required("Обов`язковий")
//   .min(4, "Посилання має складатися не менше ніж з 3 символів")
//   .max(20, "Посилання не може перевищувати 20 символи")
//   .matches(
//     /^[\w/.$#@?&-_=+]+$/g,
//     "Можна використовувати лише латинські літери"
//   ),
// keyWords: Yup.string()
//   .required("Обов`язковий")
//   .min(4, "Посилання має складатися не менше ніж з 3 символів")
//   .max(20, "Посилання не може перевищувати 20 символи")
//   .matches(
//     /^[АаБбВвГгҐґДдЕеЄєЖжЗзИиІіЇїЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя\d\s]+$/g,
//     "Можна використовувати лише українські літери, цифри та пробіли"
//   ),
// metaDescription: Yup.string()
//   .required("Обов`язковий")
//   .min(4, "Посилання має складатися не менше ніж з 3 символів")
//   .max(40, "Посилання не може перевищувати 20 символи")
//   .matches(
//     /^[АаБбВвГгҐґДдЕеЄєЖжЗзИиІіЇїЙйКкЛлМмНнОоПпРрСсТтУуФфХхЦцЧчШшЩщьЮюЯя\d\s]+$/g,
//     "Можна використовувати лише латинські літери, цифри та пробіли"
//   ),
