import foto from "../../images/photo/no_image.png"
import { INews } from "src/types/news"

type Data = {
  count: number
  rows: INews[]
}

export const temporaryData: Data[] = [
  {
    count: 15,
    rows: [
      {
        id: 1,
        banner: `${foto}`,
        title: "Title 1",
        createdAt: "2024-01-27T12:00:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 2,
        banner: `${foto}`,
        title: "Title 2",
        createdAt: "2024-01-27T13:30:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 3,
        banner: `${foto}`,
        title: "Title 3",
        createdAt: "2024-01-27T14:45:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 4,
        banner: `${foto}`,
        title: "Title 4",
        createdAt: "2024-01-27T16:15:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 5,
        banner: `${foto}`,
        title: "Title 5",
        createdAt: "2024-01-27T18:00:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 6,
        banner: `${foto}`,
        title: "Title 6",
        createdAt: "2024-01-27T19:20:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 7,
        banner: `${foto}`,
        title: "Title 7",
        createdAt: "2024-01-27T21:10:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 8,
        banner: `${foto}`,
        title: "Title 8",
        createdAt: "2024-01-27T22:45:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 9,
        banner: `${foto}`,
        title: "Title 9",
        createdAt: "2024-01-27T23:55:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 10,
        banner: `${foto}`,
        title: "Title 10",
        createdAt: "2024-01-28T01:30:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 11,
        banner: `${foto}`,
        title: "Title 11",
        createdAt: "2024-01-28T03:20:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 12,
        banner: `${foto}`,
        title: "Title 12",
        createdAt: "2024-01-28T05:00:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 13,
        banner: `${foto}`,
        title: "Title 13",
        createdAt: "2024-01-28T06:40:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 14,
        banner: `${foto}`,
        title: "Title 14",
        createdAt: "2024-01-28T08:15:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
      {
        id: 15,
        banner: `${foto}`,
        title: "Title 15",
        createdAt: "2024-01-28T09:45:00Z",
        description: `Знижка 20% на акційні товари PHarmika При наявності акційного товару. Ціни на сайті вказані з урахуванням знижки. В акції беруть участь товари, що доставляються зі складу в Україні.`,
      },
    ],
  },
]
